/* The string for canceling a map editing function. */
"CancelKey" = "Megszakítás";

/* The title text in the alert when cancelling map editing. */
"CancelEditAlertTitleKey" = "Valóban szeretné megszakítani a műveletet?";

/* The message text in the alert when cancelling map editing (no points created). */
"CancelEditAlertMessageKey" = "A módosításai nem lesznek mentve.";

/* The message text in the alert when cancelling map editing (points created). */
"CancelEditAlertPointsCreatedMessageKey" = "A létrehozott objektum nem lesz elmentve.";

/* The text of the alert action when discarding editing changes. */
"DiscardChangesTitleKey" = "Módosítások elvetése";

/* The text of the alert action when the users cancels editing an address field */
"CancelEditingTitleKey" = "Szerkesztés megszakítása";

/* The title text in the alert when entering an address that is invalid. */
"InvalidAddressTitleKey" = "Érvénytelen cím";

/* The message in the invalid address alert when an address is required. */
"AddressRequiredMessage" = "Kötelező címnek szerepelnie a ponthoz";

/* The title text in the alert when inputting empty text into a new address cell. */
"NoAddedLocationTitleKey" = "Nem adott hozzá lokációt ehhez a ponthoz";

/* The message text in the alert when inputting empty text into a new address cell. */
"NoAddedLocationMessageKey" = "Nincs hozzáadva új pont";

/* The text of the alert action to continuing editing. */
"ContinueEditingTitleKey" = "A szerkesztés folytatása";

/* The title text in the alert when tapping an invalid point when trying to delete. */
"DeletePointErrorTitleKey" = "Válasszon ki törlendő pontot.";

/* The title text in the alert when trying to delete an editing point on the map, but no editing points exist. */
"EmptyDeletePointErrorTitleKey" = "Nincsenek törlendő pontok.";

/* The text of the alert action to dismiss the alert. */
"OKTitleKey" = "OK";

/* The title text of the alert when deleting all stored editing points. */
"ClearAllPointsTitleKey" = "Valóban szeretné törölni az összes pontot?";

/* The text of the alert action to reject the alert prompt. */
"NoTitleKey" = "Nem";

/* The text of the alert action to accept the alert prompt */
"YesTitleKey" = "Igen";

/* The title text of the alert when switching editing geometries to a point. */
"ChangeGeometryPointTitleKey" = "Szeretne pontra kapcsolni?";

/* The title text of the alert when switching editing geometries to a polyline. */
"ChangeGeometryPolylineTitleKey" = "Szeretne vonalláncra kapcsolni?";

/* The title text of the alert when switching editing geometries to a polygon. */
"ChangeGeometryPolygonTitleKey" = "Szeretne sokszögre kapcsolni?";

/* The message text in the alert when switching to a multipoint geometry. */
"ChangeGeometryToMultiPointMessageKey" = "A hozzáadott pontok nem fognak módosulni, folytathatja az objektum létrehozását";

/* The message text in the alert when switching to a point geometry. */
"ChangeGeometryToPointMessageKey" = "Az összes hozzáadott pont törlése";

/* The title text of the alert when deleting a point of the editing geometry. */
"DeletePointTitleKey" = "Valóban szeretné törölni ezt a pontot?";

/* The title of the button to save the editing geometry. */
"SaveButtonTitleKey" = "Mentés";

/* The title of the button to filter the geometry. */
"FilterTitleKey" = "Szűrés";

/* The status text of the User Location TableViewCell in the suggesiton panel. */
"CurrentLocationKey" = "Tartózkodási hely";

/* The footnote text of the TableViewCell in the suggesiton panel if no suggestions are returned. */
"NoSuggestionsFoundKey" = "Nem találhatók javaslatok";

/* The text of the editingPanel Address textField. */
"AddressKey" = "Cím";

/* The title of the button to delete all stored editing points. */
"ClearAllKey" = "Összes törlése";

/* The text of the Toast Message after creating an object. */
"CreatedObjectToastMessage" = "%@ Sikeresen létrejött";

/* The placeholder text of the Searchbar */
"SearchKey" = "Keresés";

/* The placeholder text to add a new geospatial point by tapping on the map or typing an address. */
"AddNewPointKey" = "Új pont hozzáadása";

/* The title of the cell to pick from available map types. */
"BasemapKey" = "Referenciatérkép";

/* The title for the standard map type. */
"StandardKey" = "Standard";

/* The title for the hybrid map type. */
"HybridKey" = "Hibrid";

/* The title for the hybrid flyover map type. */
"HybridFlyoverKey" = "Hibrid Flyover";

/* The title for the muted standard map type. */
"MutedStandardKey" = "Némított standard";

/* The title for the satellite map type. */
"SatelliteKey" = "Műhold";

/* The title for the satellite flyover map type. */
"SatelliteFlyoverKey" = "Műhold Flyover";

/* The text of add location button for location form cell. */
"AddLocationButtonKey" = "Hely hozzáadása";

